Config/InformationRegisters/НастройкиДокументовУчетаГСМ.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>НастройкиДокументовУчетаГСМ</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ЦМОСписанияГСМ</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.МестаХранения</v8:Type>
						<v8:Type>cfg:CatalogRef.ЦМО</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Водитель</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ЗаполнятьРеквизитВодительПринял</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ЗаполнятьРеквизитВодительСдал</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ЛицензионнаяКарточка</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЛицензионныеКарточки</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ЗаполнятьПоказанияСпидометраПоДаннымТаксировкиПоследнегоПЛ</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ЗаполнятьПоказанияСпидометраПоДаннымПоследнегоПЛ</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ЗаполнятьОстатокГорючегоПоДаннымТаксировкиПоследнегоПЛ</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ЗаполнятьОстатокГорючегоПоДаннымПоследнегоПЛ</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>АдресПодачи</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>210</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ВРаспоряжениеОрганизация</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ВРаспоряжениеНаименование</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Маршрут</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.МаршрутыАвтобусов</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ВодительВторойСмены</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>НомерУдостоверенияВодителяПервойСмены</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>30</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>НомерУдостоверенияВодителяВторойСмены</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>30</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ОсобыеОтметки</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>РЛАМОЛ</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>РЛАПодразделение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Подразделения</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>РЛАЗапланированоМоторесурсов</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>17</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>РЛАЕдиницаИзмеренияМоторесурсов</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.КлассификаторЕдиницИзмерения</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>РЛАРуководительПодразделения</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>РЛАОсновнойПараметрРасчета</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыПараметровДляНормРасходаГСМДляАгрегатов</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДиспетчерПриВыезде</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДиспетчерПриВозвращении</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>МеханикПриВыезде</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>МеханикПриВозвращении</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ЛицоДопускающееВодителяПоСостояниюЗдоровья</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СопровождающиеЛица</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>КондукторПервойСмены</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>КондукторВторойСмены</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>НомерУдостоверенияКондуктораПервойСмены</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>30</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>НомерУдостоверенияКондуктораВторойСмены</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>30</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Заказчик</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>НачалоПериода</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>КонецПериода</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СтоимостьОдногоМашиноЧаса</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>17</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Участок</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>300</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>КодВидаОперации</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>30</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Прораб</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>РуководительПодразделения</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Прицепщик</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Бригадир</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ЕдиницаИзмеренияРаботы</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.КлассификаторЕдиницИзмерения</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СведенияОПеревозке</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ВидПеревозки</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ВидСообщения</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыСообщения</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СведенияОВидахСообщения</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ОсновноеСредство</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ОсновныеСредства</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ВидОбъектаРасходаГСМ</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыОбъектовРасходаГСМ</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ВидДокументаУчетаГСМ</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ИдентификаторыОбъектовМетаданных</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Config/InformationRegisters/НастройкиДокументовУчетаГСМ/Forms/ФормаСервисныеФункции/Ext/Form/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Организация = ОбщегоНазначенияБГУ.ТекущаяОрганизация();
	ДатаСведений = ТекущаяДатаСеанса();
	ДатаНачалаОтбора = НачалоГода(ДатаСведений);
	ДатаОкончанияОтбора = КонецГода(ДатаСведений);
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура УстановитьПериод(Команда)
	СтруктураПараметров = Новый Структура();
	СтруктураПараметров.Вставить("ДатаНачалаОтбора",	ДатаНачалаОтбора);
	СтруктураПараметров.Вставить("ДатаОкончанияОтбора",	ДатаОкончанияОтбора);
	
	СтандартныеОтчетыКлиент.ВыборПериодаОтчета(СтруктураПараметров, ЭтаФорма);
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьДокументы(Команда)
	ЗаполнитьДокументыНаСервере();
КонецПроцедуры

&НаКлиенте
Процедура ОбработатьДокументы(Команда)
	ОбработатьДокументыНаСервере();
	
	Сообщить(НСтр("ru='Операция завершена.'"));
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаКлиенте
Процедура УстановитьПериод_Выбор(РезультатВыбора, ПараметрыОповещения) Экспорт
	
	Если ТипЗнч(РезультатВыбора) = Тип("Структура") Тогда
		ДатаНачалаОтбора = РезультатВыбора["НачалоПериода"];
		ДатаОкончанияОтбора = РезультатВыбора["КонецПериода"];
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьДокументыНаСервере()
	Если ВидОперации = 0 Тогда
		ЗаполнитьДокументыДляОперацииЗаполненияГаражныхНомеровНаСервере();
	КонецЕсли;	
КонецПроцедуры

&НаСервере
Процедура ОбработатьДокументыНаСервере()
	Если ВидОперации = 0 Тогда
		ОбработатьДокументыДляОперацииЗаполненияГаражныхНомеровНаСервере();
	КонецЕсли;	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьДокументыДляОперацииЗаполненияГаражныхНомеровНаСервере()
	ДокументыУчетаГСМ.Очистить();
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ЖурналПутевыхЛистов.Ссылка КАК ДокументСсылка,
	|	ЖурналПутевыхЛистов.ГаражныйНомер КАК ДокументГаражныйНомер,
	|	ЖурналПутевыхЛистов.ТранспортноеСредство КАК ТранспортноеСредство,
	|	ПаспортаТранспортныхСредствСрезПоследних.ГаражныйНомер КАК ПаспортГаражныйНомер,
	|	ПаспортаТранспортныхСредствСрезПоследних.ОсновноеСредство КАК ОсновноеСредство,
	|	ИСТИНА КАК ДокументВыбран
	|ИЗ
	|	ЖурналДокументов.ЖурналПутевыхЛистов КАК ЖурналПутевыхЛистов
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.ПаспортаТранспортныхСредств.СрезПоследних(&ДатаСведений, Организация = &Организация) КАК ПаспортаТранспортныхСредствСрезПоследних
	|		ПО ЖурналПутевыхЛистов.ТранспортноеСредство = ПаспортаТранспортныхСредствСрезПоследних.ОсновноеСредство
	|ГДЕ
	|	ЖурналПутевыхЛистов.ГаражныйНомер <> ПаспортаТранспортныхСредствСрезПоследних.ГаражныйНомер
	|	И НЕ ПаспортаТранспортныхСредствСрезПоследних.ГаражныйНомер = &ПустойГаражныйНомер
	|	И ЖурналПутевыхЛистов.Организация = &Организация
	|	И ЖурналПутевыхЛистов.Дата МЕЖДУ &ДатаНачалоПериода И &ДатаКонецПериода
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ТаксировкаПутевогоЛиста.Ссылка,
	|	ТаксировкаПутевогоЛиста.ГаражныйНомер,
	|	ТаксировкаПутевогоЛиста.ТранспортноеСредство,
	|	ПаспортаТранспортныхСредствСрезПоследних.ГаражныйНомер,
	|	ПаспортаТранспортныхСредствСрезПоследних.ОсновноеСредство,
	|	ИСТИНА
	|ИЗ
	|	Документ.ТаксировкаПутевогоЛиста КАК ТаксировкаПутевогоЛиста
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ПаспортаТранспортныхСредств.СрезПоследних(&ДатаСведений, Организация = &Организация) КАК ПаспортаТранспортныхСредствСрезПоследних
	|		ПО ТаксировкаПутевогоЛиста.ТранспортноеСредство = ПаспортаТранспортныхСредствСрезПоследних.ОсновноеСредство
	|ГДЕ
	|	ТаксировкаПутевогоЛиста.ГаражныйНомер <> ПаспортаТранспортныхСредствСрезПоследних.ГаражныйНомер
	|	И НЕ ПаспортаТранспортныхСредствСрезПоследних.ГаражныйНомер = &ПустойГаражныйНомер
	|	И ТаксировкаПутевогоЛиста.Организация = &Организация
	|	И ТаксировкаПутевогоЛиста.Дата МЕЖДУ &ДатаНачалоПериода И &ДатаКонецПериода";	
	
	Запрос.УстановитьПараметр("Организация", Организация);
	Запрос.УстановитьПараметр("ДатаНачалоПериода", ДатаНачалаОтбора);
	Запрос.УстановитьПараметр("ДатаКонецПериода", ДатаОкончанияОтбора);
	Запрос.УстановитьПараметр("ДатаСведений", ДатаСведений);
	Запрос.УстановитьПараметр("ПустойГаражныйНомер", "");
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		НоваяСтрока = ДокументыУчетаГСМ.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока, Выборка); 	
	КонецЦикла;	
КонецПроцедуры

&НаСервере
Процедура ОбработатьДокументыДляОперацииЗаполненияГаражныхНомеровНаСервере()
	Для Каждого ТекСтрока Из ДокументыУчетаГСМ Цикл
		Если ТекСтрока.ДокументВыбран И ЗначениеЗаполнено(ТекСтрока.ДокументСсылка) И ЗначениеЗаполнено(ТекСтрока.ПаспортГаражныйНомер) Тогда
			Регистратор = ТекСтрока.ДокументСсылка;
			Попытка
				
				НачатьТранзакцию();
				
				// Заполниим новый реквизит ДатаИнвентаризации значением по-умолчанию.
				ДокументОбъект = Регистратор.ПолучитьОбъект();
				ДокументОбъект.ГаражныйНомер = ТекСтрока.ПаспортГаражныйНомер;
				
				ОбновлениеИнформационнойБазы.ЗаписатьОбъект(ДокументОбъект);
				
				ЗафиксироватьТранзакцию();
				
			Исключение
				
				ОтменитьТранзакцию();
				ВызватьИсключение;
				
			КонецПопытки;
		КонецЕсли;
	КонецЦикла;
КонецПроцедуры

#КонецОбласти
